docs/site/20241002134323-musescore.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-21 Sat 11:04 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>MuseScore</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="../style.css" type="text/css">
</head>
<body>
<div id="content" class="content">
<h1 class="title">MuseScore</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org7e30da5">Module 1: Beginnings</a></li>
<li><a href="#orgef1bcb8">Module 2</a></li>
</ul>
</div>
</div>
<div id="outline-container-org7e30da5" class="outline-2">
<h2 id="org7e30da5">Module 1: Beginnings</h2>
<div class="outline-text-2" id="text-org7e30da5">
<ol class="org-ol">
<li>Open MuseScore</li>
<li>New Score
<ol class="org-ol">
<li>Choose from scratch or from template
<ul class="org-ul">
<li>Use scratch for education purposes</li>
</ul></li>
<li>Order of voices</li>
<li>Click Next not done to pick time signatures, key signatures, measures, etc</li>
<li>Pick starting values</li>
<li>Input Title and Arranger text</li>
<li>Click Done</li>
</ol></li>
<li>Structure setup
<ol class="org-ol">
<li>Key changes
<ol class="org-ol">
<li>Select the measure to start, then go to key change palette and click the appropriate key signature</li>
<li>Need to add double barline!
<ol class="org-ol">
<li>Click the barline</li>
<li>Go to barlines palette and click on the double barline icon</li>
</ol></li>
</ol></li>
<li>Clef
<ol class="org-ol">
<li>Change starting clef
<ol class="org-ol">
<li>Click the clef you want to change, then the corresponding clef</li>
<li>OR drag the clef where you want it</li>
<li>Possibly note that if you have a selection of measures it will change the clef at end of selection</li>
</ol></li>
</ol></li>
<li>Time Signatures
<ol class="org-ol">
<li>Changing starting time signature</li>
</ol></li>
<li>Adding Measures</li>
<li>Text Adjustments
<ol class="org-ol">
<li>Properties tab to make <i>arranged by</i> italic</li>
<li>Delete Subtitle</li>
<li>Size of title to 18pt for small caps</li>
</ol></li>
</ol></li>
<li>Note input
<ol class="org-ol">
<li>N to enter, Escape twice to exit</li>
<li>Click the first measure
<ol class="org-ol">
<li>Note least efficient</li>
<li>For ties when you click T the next duration needs to be set already</li>
<li>Accidentals</li>
<li>Use arrow keys to chromatically change a selected pitch
<ul class="org-ul">
<li>can copy and paste lots of times and adjust with this</li>
</ul></li>
<li>Voices Ctrl+Alt+Num or toolbar
<ul class="org-ul">
<li>Make sure in note input mode before clicking voice button</li>
</ul></li>
<li>Slurs input the note, then S or toolbar. Repeat action to stop the slur</li>
</ol></li>
<li>Type into score
<ol class="org-ol">
<li>Octave shortcuts
<ol class="org-ol">
<li>Ctrl up and down for octaves</li>
</ol></li>
<li>Chords use shift letter to go up, or alt number to go up interval (below exists, but only with custom keybindings. Start with the bottom)</li>
<li>Rests are 0 on keypad</li>
<li>Slurs hit S or toolbar, repeat to stop</li>
<li>Ties
<ol class="org-ol">
<li>When you hit T, the duration needs to already be set</li>
</ol></li>
</ol></li>
<li>MIDI keyboard
<ol class="org-ol">
<li>Pitch is last</li>
<li>Chords do all at once</li>
<li>Rests with 0</li>
<li>Slurs same</li>
<li>Ties same</li>
</ol></li>
<li>Copy and paste the first measures (use r)</li>
</ol></li>
<li>Adding marks later
<ol class="org-ol">
<li>Slurs
<ol class="org-ol">
<li>select first note and last note (with ctrl) hit S</li>
<li>select first note hit S, then shift arrow key to move around</li>
<li>select first note, shift last note to add slurs to all voices (also for cross staff voices)</li>
</ol></li>
<li>Fermatas
<ol class="org-ol">
<li>Need to add the Breahes and Pauses palette
<ol class="org-ol">
<li>Click add palettes</li>
<li>Click the plus sign by breathes and pauses</li>
<li>Escape to close the add palettes button</li>
</ol></li>
<li>Select note (or notes, esp end)
<ol class="org-ol">
<li>click the fermata</li>
</ol></li>
</ol></li>
<li>Lyrics
<ol class="org-ol">
<li>Select a note, then Ctrl or Alt L to enter lyric mode
<ol class="org-ol">
<li>Can also double click on an existing lyric</li>
</ol></li>
<li>Type a syllable at a time, and advance with space or -</li>
<li>If you need an actual space or hyphen or underscore, use Ctrl space or Ctrl -</li>
<li>For an extension line, use the _ (musescore does not put these in automatically!)</li>
<li>You can add verses by going into lyric mode again where there are already lyrics.
<ul class="org-ul">
<li>You can switch verses with up or down in lyirc mode</li>
</ul></li>
</ol></li>
</ol></li>
</ol>
</div>
</div>
<div id="outline-container-orgef1bcb8" class="outline-2">
<h2 id="orgef1bcb8">Module 2</h2>
<div class="outline-text-2" id="text-orgef1bcb8">
<ol class="org-ol">
<li>Hairpins
<ol class="org-ol">
<li>Dynamics palette</li>
<li>Select note, then select hairpin</li>
<li>Shift arrow key will adjust length</li>
</ol></li>
<li>Dynamics
<ol class="org-ol">
<li>Same as above without number 3</li>
<li>Sometimes inputting dynamics results in collisions as musescore tries to align them.</li>
</ol></li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p><a href="sitemap.html">Site Map</a></p>
</div>
</body>
</html>
